// Створити розмітку з двома текстовими полями та кнопкою.
//При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення
//"Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

function validateForm() {
  // Get form fields
  const box1 = document.getElementById("box1");
  const box2 = document.getElementById("box2");

  // Validate fields
  if (box1.value !== "" && box2.value !== "") {
    alert("Обидва поля заповнені");
    // Code to submit form...
  } else {
    alert("Не всі поля заповнені");
    // Code to prevent form submission...
  }
}

// Створити розмітку з двома числовими полями та кнопкою. 
//При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, 
//то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

// Створити розмітку з текстовим полем та кнопкою. 
//При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення 
//"Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

// Створити розмітку з формою з полями введення та кнопкою. 
//При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення 
//"Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".

// Створити розмітку з формою з полями введення та кнопкою. 
//При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, 
//якщо ні — виводити повідомлення про помилку.Правильно заповнені дані: ім'я містить не менше 3 символів, 
//email містить символ @та крапку після неї, пароль містить не менше 6 символів.